

dictionary = {
        "lab": "Лабораторная работа",
        "sdo": "Тест СДО",
        "kurs": "Курсовая работа"
}

text_not_access = "❌ У вас нет доступа к этому чат-боту"

text_main=("📌 Вы находитель на главной странице чат-бота")

text_orders = ("📌 Здесь представлены все заказы, которые находятся в статусе ожидания")

text_orders_all = ("📌 Здесь представлены все существующие заказы. Перейдя в фильтры, можно отфильтровать заказы по статусу выполнения и типу работы.")

text_orders_filters = ("📌 Выберите фильтры")

text_order_history=("📌 Здесь находится история выполненных вами заказов""\n\n"
"Выберите тип заказа, чтобы открыть список выполненных заказов")

text_services = ("📌 Здесь вам необходимо создать заявку о предоставлении услуг по конкретным предметам и конкретным типам работы "
"(Тесты СДО, лабораторные и прочее)")

text_select_services_year = ("📌 Нажмите на курс, чтобы перейти к выбору предметов")

text_select_services_subject = ("📌 Нажмите на предмет, чтобы перейти к выбору работ для этого предмета")

text_select_services_work = ("📌 Выберите работы по данному предмету. Можно выбрать несколько")

